###################################################################

# Created by write_sdc on Sat Dec 16 15:36:59 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_max_fanout 8 [current_design]
set_load -pin_load 0.05 [get_ports o_rd_vld]
set_load -pin_load 0.05 [get_ports o_last_data]
set_load -pin_load 0.05 [get_ports {o_y_hat[159]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[158]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[157]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[156]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[155]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[154]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[153]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[152]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[151]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[150]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[149]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[148]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[147]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[146]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[145]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[144]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[143]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[142]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[141]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[140]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[139]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[138]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[137]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[136]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[135]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[134]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[133]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[132]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[131]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[130]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[129]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[128]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[127]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[126]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[125]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[124]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[123]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[122]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[121]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[120]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[119]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[118]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[117]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[116]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[115]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[114]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[113]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[112]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[111]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[110]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[109]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[108]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[107]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[106]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[105]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[104]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[103]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[102]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[101]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[100]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[99]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[98]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[97]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[96]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[95]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[94]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[93]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[92]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[91]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[90]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[89]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[88]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[87]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[86]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[85]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[84]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[83]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[82]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[81]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[80]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[79]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[78]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[77]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[76]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[75]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[74]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[73]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[72]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[71]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[70]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[69]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[68]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[67]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[66]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[65]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[64]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[63]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[62]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[61]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[60]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[59]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[58]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[57]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[56]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[55]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[54]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[53]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[52]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[51]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[50]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[49]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[48]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[47]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[46]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[45]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[44]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[43]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[42]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[41]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[40]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[39]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[38]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[37]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[36]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[35]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[34]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[33]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[32]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[31]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[30]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[29]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[28]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[27]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[26]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[25]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[24]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[23]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[22]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[21]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[20]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[19]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[18]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[17]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[16]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[15]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[14]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[13]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[12]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[11]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[10]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[9]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[8]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[7]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[6]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[5]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[4]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[3]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[2]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[1]}]
set_load -pin_load 0.05 [get_ports {o_y_hat[0]}]
set_load -pin_load 0.05 [get_ports {o_r[319]}]
set_load -pin_load 0.05 [get_ports {o_r[318]}]
set_load -pin_load 0.05 [get_ports {o_r[317]}]
set_load -pin_load 0.05 [get_ports {o_r[316]}]
set_load -pin_load 0.05 [get_ports {o_r[315]}]
set_load -pin_load 0.05 [get_ports {o_r[314]}]
set_load -pin_load 0.05 [get_ports {o_r[313]}]
set_load -pin_load 0.05 [get_ports {o_r[312]}]
set_load -pin_load 0.05 [get_ports {o_r[311]}]
set_load -pin_load 0.05 [get_ports {o_r[310]}]
set_load -pin_load 0.05 [get_ports {o_r[309]}]
set_load -pin_load 0.05 [get_ports {o_r[308]}]
set_load -pin_load 0.05 [get_ports {o_r[307]}]
set_load -pin_load 0.05 [get_ports {o_r[306]}]
set_load -pin_load 0.05 [get_ports {o_r[305]}]
set_load -pin_load 0.05 [get_ports {o_r[304]}]
set_load -pin_load 0.05 [get_ports {o_r[303]}]
set_load -pin_load 0.05 [get_ports {o_r[302]}]
set_load -pin_load 0.05 [get_ports {o_r[301]}]
set_load -pin_load 0.05 [get_ports {o_r[300]}]
set_load -pin_load 0.05 [get_ports {o_r[299]}]
set_load -pin_load 0.05 [get_ports {o_r[298]}]
set_load -pin_load 0.05 [get_ports {o_r[297]}]
set_load -pin_load 0.05 [get_ports {o_r[296]}]
set_load -pin_load 0.05 [get_ports {o_r[295]}]
set_load -pin_load 0.05 [get_ports {o_r[294]}]
set_load -pin_load 0.05 [get_ports {o_r[293]}]
set_load -pin_load 0.05 [get_ports {o_r[292]}]
set_load -pin_load 0.05 [get_ports {o_r[291]}]
set_load -pin_load 0.05 [get_ports {o_r[290]}]
set_load -pin_load 0.05 [get_ports {o_r[289]}]
set_load -pin_load 0.05 [get_ports {o_r[288]}]
set_load -pin_load 0.05 [get_ports {o_r[287]}]
set_load -pin_load 0.05 [get_ports {o_r[286]}]
set_load -pin_load 0.05 [get_ports {o_r[285]}]
set_load -pin_load 0.05 [get_ports {o_r[284]}]
set_load -pin_load 0.05 [get_ports {o_r[283]}]
set_load -pin_load 0.05 [get_ports {o_r[282]}]
set_load -pin_load 0.05 [get_ports {o_r[281]}]
set_load -pin_load 0.05 [get_ports {o_r[280]}]
set_load -pin_load 0.05 [get_ports {o_r[279]}]
set_load -pin_load 0.05 [get_ports {o_r[278]}]
set_load -pin_load 0.05 [get_ports {o_r[277]}]
set_load -pin_load 0.05 [get_ports {o_r[276]}]
set_load -pin_load 0.05 [get_ports {o_r[275]}]
set_load -pin_load 0.05 [get_ports {o_r[274]}]
set_load -pin_load 0.05 [get_ports {o_r[273]}]
set_load -pin_load 0.05 [get_ports {o_r[272]}]
set_load -pin_load 0.05 [get_ports {o_r[271]}]
set_load -pin_load 0.05 [get_ports {o_r[270]}]
set_load -pin_load 0.05 [get_ports {o_r[269]}]
set_load -pin_load 0.05 [get_ports {o_r[268]}]
set_load -pin_load 0.05 [get_ports {o_r[267]}]
set_load -pin_load 0.05 [get_ports {o_r[266]}]
set_load -pin_load 0.05 [get_ports {o_r[265]}]
set_load -pin_load 0.05 [get_ports {o_r[264]}]
set_load -pin_load 0.05 [get_ports {o_r[263]}]
set_load -pin_load 0.05 [get_ports {o_r[262]}]
set_load -pin_load 0.05 [get_ports {o_r[261]}]
set_load -pin_load 0.05 [get_ports {o_r[260]}]
set_load -pin_load 0.05 [get_ports {o_r[259]}]
set_load -pin_load 0.05 [get_ports {o_r[258]}]
set_load -pin_load 0.05 [get_ports {o_r[257]}]
set_load -pin_load 0.05 [get_ports {o_r[256]}]
set_load -pin_load 0.05 [get_ports {o_r[255]}]
set_load -pin_load 0.05 [get_ports {o_r[254]}]
set_load -pin_load 0.05 [get_ports {o_r[253]}]
set_load -pin_load 0.05 [get_ports {o_r[252]}]
set_load -pin_load 0.05 [get_ports {o_r[251]}]
set_load -pin_load 0.05 [get_ports {o_r[250]}]
set_load -pin_load 0.05 [get_ports {o_r[249]}]
set_load -pin_load 0.05 [get_ports {o_r[248]}]
set_load -pin_load 0.05 [get_ports {o_r[247]}]
set_load -pin_load 0.05 [get_ports {o_r[246]}]
set_load -pin_load 0.05 [get_ports {o_r[245]}]
set_load -pin_load 0.05 [get_ports {o_r[244]}]
set_load -pin_load 0.05 [get_ports {o_r[243]}]
set_load -pin_load 0.05 [get_ports {o_r[242]}]
set_load -pin_load 0.05 [get_ports {o_r[241]}]
set_load -pin_load 0.05 [get_ports {o_r[240]}]
set_load -pin_load 0.05 [get_ports {o_r[239]}]
set_load -pin_load 0.05 [get_ports {o_r[238]}]
set_load -pin_load 0.05 [get_ports {o_r[237]}]
set_load -pin_load 0.05 [get_ports {o_r[236]}]
set_load -pin_load 0.05 [get_ports {o_r[235]}]
set_load -pin_load 0.05 [get_ports {o_r[234]}]
set_load -pin_load 0.05 [get_ports {o_r[233]}]
set_load -pin_load 0.05 [get_ports {o_r[232]}]
set_load -pin_load 0.05 [get_ports {o_r[231]}]
set_load -pin_load 0.05 [get_ports {o_r[230]}]
set_load -pin_load 0.05 [get_ports {o_r[229]}]
set_load -pin_load 0.05 [get_ports {o_r[228]}]
set_load -pin_load 0.05 [get_ports {o_r[227]}]
set_load -pin_load 0.05 [get_ports {o_r[226]}]
set_load -pin_load 0.05 [get_ports {o_r[225]}]
set_load -pin_load 0.05 [get_ports {o_r[224]}]
set_load -pin_load 0.05 [get_ports {o_r[223]}]
set_load -pin_load 0.05 [get_ports {o_r[222]}]
set_load -pin_load 0.05 [get_ports {o_r[221]}]
set_load -pin_load 0.05 [get_ports {o_r[220]}]
set_load -pin_load 0.05 [get_ports {o_r[219]}]
set_load -pin_load 0.05 [get_ports {o_r[218]}]
set_load -pin_load 0.05 [get_ports {o_r[217]}]
set_load -pin_load 0.05 [get_ports {o_r[216]}]
set_load -pin_load 0.05 [get_ports {o_r[215]}]
set_load -pin_load 0.05 [get_ports {o_r[214]}]
set_load -pin_load 0.05 [get_ports {o_r[213]}]
set_load -pin_load 0.05 [get_ports {o_r[212]}]
set_load -pin_load 0.05 [get_ports {o_r[211]}]
set_load -pin_load 0.05 [get_ports {o_r[210]}]
set_load -pin_load 0.05 [get_ports {o_r[209]}]
set_load -pin_load 0.05 [get_ports {o_r[208]}]
set_load -pin_load 0.05 [get_ports {o_r[207]}]
set_load -pin_load 0.05 [get_ports {o_r[206]}]
set_load -pin_load 0.05 [get_ports {o_r[205]}]
set_load -pin_load 0.05 [get_ports {o_r[204]}]
set_load -pin_load 0.05 [get_ports {o_r[203]}]
set_load -pin_load 0.05 [get_ports {o_r[202]}]
set_load -pin_load 0.05 [get_ports {o_r[201]}]
set_load -pin_load 0.05 [get_ports {o_r[200]}]
set_load -pin_load 0.05 [get_ports {o_r[199]}]
set_load -pin_load 0.05 [get_ports {o_r[198]}]
set_load -pin_load 0.05 [get_ports {o_r[197]}]
set_load -pin_load 0.05 [get_ports {o_r[196]}]
set_load -pin_load 0.05 [get_ports {o_r[195]}]
set_load -pin_load 0.05 [get_ports {o_r[194]}]
set_load -pin_load 0.05 [get_ports {o_r[193]}]
set_load -pin_load 0.05 [get_ports {o_r[192]}]
set_load -pin_load 0.05 [get_ports {o_r[191]}]
set_load -pin_load 0.05 [get_ports {o_r[190]}]
set_load -pin_load 0.05 [get_ports {o_r[189]}]
set_load -pin_load 0.05 [get_ports {o_r[188]}]
set_load -pin_load 0.05 [get_ports {o_r[187]}]
set_load -pin_load 0.05 [get_ports {o_r[186]}]
set_load -pin_load 0.05 [get_ports {o_r[185]}]
set_load -pin_load 0.05 [get_ports {o_r[184]}]
set_load -pin_load 0.05 [get_ports {o_r[183]}]
set_load -pin_load 0.05 [get_ports {o_r[182]}]
set_load -pin_load 0.05 [get_ports {o_r[181]}]
set_load -pin_load 0.05 [get_ports {o_r[180]}]
set_load -pin_load 0.05 [get_ports {o_r[179]}]
set_load -pin_load 0.05 [get_ports {o_r[178]}]
set_load -pin_load 0.05 [get_ports {o_r[177]}]
set_load -pin_load 0.05 [get_ports {o_r[176]}]
set_load -pin_load 0.05 [get_ports {o_r[175]}]
set_load -pin_load 0.05 [get_ports {o_r[174]}]
set_load -pin_load 0.05 [get_ports {o_r[173]}]
set_load -pin_load 0.05 [get_ports {o_r[172]}]
set_load -pin_load 0.05 [get_ports {o_r[171]}]
set_load -pin_load 0.05 [get_ports {o_r[170]}]
set_load -pin_load 0.05 [get_ports {o_r[169]}]
set_load -pin_load 0.05 [get_ports {o_r[168]}]
set_load -pin_load 0.05 [get_ports {o_r[167]}]
set_load -pin_load 0.05 [get_ports {o_r[166]}]
set_load -pin_load 0.05 [get_ports {o_r[165]}]
set_load -pin_load 0.05 [get_ports {o_r[164]}]
set_load -pin_load 0.05 [get_ports {o_r[163]}]
set_load -pin_load 0.05 [get_ports {o_r[162]}]
set_load -pin_load 0.05 [get_ports {o_r[161]}]
set_load -pin_load 0.05 [get_ports {o_r[160]}]
set_load -pin_load 0.05 [get_ports {o_r[159]}]
set_load -pin_load 0.05 [get_ports {o_r[158]}]
set_load -pin_load 0.05 [get_ports {o_r[157]}]
set_load -pin_load 0.05 [get_ports {o_r[156]}]
set_load -pin_load 0.05 [get_ports {o_r[155]}]
set_load -pin_load 0.05 [get_ports {o_r[154]}]
set_load -pin_load 0.05 [get_ports {o_r[153]}]
set_load -pin_load 0.05 [get_ports {o_r[152]}]
set_load -pin_load 0.05 [get_ports {o_r[151]}]
set_load -pin_load 0.05 [get_ports {o_r[150]}]
set_load -pin_load 0.05 [get_ports {o_r[149]}]
set_load -pin_load 0.05 [get_ports {o_r[148]}]
set_load -pin_load 0.05 [get_ports {o_r[147]}]
set_load -pin_load 0.05 [get_ports {o_r[146]}]
set_load -pin_load 0.05 [get_ports {o_r[145]}]
set_load -pin_load 0.05 [get_ports {o_r[144]}]
set_load -pin_load 0.05 [get_ports {o_r[143]}]
set_load -pin_load 0.05 [get_ports {o_r[142]}]
set_load -pin_load 0.05 [get_ports {o_r[141]}]
set_load -pin_load 0.05 [get_ports {o_r[140]}]
set_load -pin_load 0.05 [get_ports {o_r[139]}]
set_load -pin_load 0.05 [get_ports {o_r[138]}]
set_load -pin_load 0.05 [get_ports {o_r[137]}]
set_load -pin_load 0.05 [get_ports {o_r[136]}]
set_load -pin_load 0.05 [get_ports {o_r[135]}]
set_load -pin_load 0.05 [get_ports {o_r[134]}]
set_load -pin_load 0.05 [get_ports {o_r[133]}]
set_load -pin_load 0.05 [get_ports {o_r[132]}]
set_load -pin_load 0.05 [get_ports {o_r[131]}]
set_load -pin_load 0.05 [get_ports {o_r[130]}]
set_load -pin_load 0.05 [get_ports {o_r[129]}]
set_load -pin_load 0.05 [get_ports {o_r[128]}]
set_load -pin_load 0.05 [get_ports {o_r[127]}]
set_load -pin_load 0.05 [get_ports {o_r[126]}]
set_load -pin_load 0.05 [get_ports {o_r[125]}]
set_load -pin_load 0.05 [get_ports {o_r[124]}]
set_load -pin_load 0.05 [get_ports {o_r[123]}]
set_load -pin_load 0.05 [get_ports {o_r[122]}]
set_load -pin_load 0.05 [get_ports {o_r[121]}]
set_load -pin_load 0.05 [get_ports {o_r[120]}]
set_load -pin_load 0.05 [get_ports {o_r[119]}]
set_load -pin_load 0.05 [get_ports {o_r[118]}]
set_load -pin_load 0.05 [get_ports {o_r[117]}]
set_load -pin_load 0.05 [get_ports {o_r[116]}]
set_load -pin_load 0.05 [get_ports {o_r[115]}]
set_load -pin_load 0.05 [get_ports {o_r[114]}]
set_load -pin_load 0.05 [get_ports {o_r[113]}]
set_load -pin_load 0.05 [get_ports {o_r[112]}]
set_load -pin_load 0.05 [get_ports {o_r[111]}]
set_load -pin_load 0.05 [get_ports {o_r[110]}]
set_load -pin_load 0.05 [get_ports {o_r[109]}]
set_load -pin_load 0.05 [get_ports {o_r[108]}]
set_load -pin_load 0.05 [get_ports {o_r[107]}]
set_load -pin_load 0.05 [get_ports {o_r[106]}]
set_load -pin_load 0.05 [get_ports {o_r[105]}]
set_load -pin_load 0.05 [get_ports {o_r[104]}]
set_load -pin_load 0.05 [get_ports {o_r[103]}]
set_load -pin_load 0.05 [get_ports {o_r[102]}]
set_load -pin_load 0.05 [get_ports {o_r[101]}]
set_load -pin_load 0.05 [get_ports {o_r[100]}]
set_load -pin_load 0.05 [get_ports {o_r[99]}]
set_load -pin_load 0.05 [get_ports {o_r[98]}]
set_load -pin_load 0.05 [get_ports {o_r[97]}]
set_load -pin_load 0.05 [get_ports {o_r[96]}]
set_load -pin_load 0.05 [get_ports {o_r[95]}]
set_load -pin_load 0.05 [get_ports {o_r[94]}]
set_load -pin_load 0.05 [get_ports {o_r[93]}]
set_load -pin_load 0.05 [get_ports {o_r[92]}]
set_load -pin_load 0.05 [get_ports {o_r[91]}]
set_load -pin_load 0.05 [get_ports {o_r[90]}]
set_load -pin_load 0.05 [get_ports {o_r[89]}]
set_load -pin_load 0.05 [get_ports {o_r[88]}]
set_load -pin_load 0.05 [get_ports {o_r[87]}]
set_load -pin_load 0.05 [get_ports {o_r[86]}]
set_load -pin_load 0.05 [get_ports {o_r[85]}]
set_load -pin_load 0.05 [get_ports {o_r[84]}]
set_load -pin_load 0.05 [get_ports {o_r[83]}]
set_load -pin_load 0.05 [get_ports {o_r[82]}]
set_load -pin_load 0.05 [get_ports {o_r[81]}]
set_load -pin_load 0.05 [get_ports {o_r[80]}]
set_load -pin_load 0.05 [get_ports {o_r[79]}]
set_load -pin_load 0.05 [get_ports {o_r[78]}]
set_load -pin_load 0.05 [get_ports {o_r[77]}]
set_load -pin_load 0.05 [get_ports {o_r[76]}]
set_load -pin_load 0.05 [get_ports {o_r[75]}]
set_load -pin_load 0.05 [get_ports {o_r[74]}]
set_load -pin_load 0.05 [get_ports {o_r[73]}]
set_load -pin_load 0.05 [get_ports {o_r[72]}]
set_load -pin_load 0.05 [get_ports {o_r[71]}]
set_load -pin_load 0.05 [get_ports {o_r[70]}]
set_load -pin_load 0.05 [get_ports {o_r[69]}]
set_load -pin_load 0.05 [get_ports {o_r[68]}]
set_load -pin_load 0.05 [get_ports {o_r[67]}]
set_load -pin_load 0.05 [get_ports {o_r[66]}]
set_load -pin_load 0.05 [get_ports {o_r[65]}]
set_load -pin_load 0.05 [get_ports {o_r[64]}]
set_load -pin_load 0.05 [get_ports {o_r[63]}]
set_load -pin_load 0.05 [get_ports {o_r[62]}]
set_load -pin_load 0.05 [get_ports {o_r[61]}]
set_load -pin_load 0.05 [get_ports {o_r[60]}]
set_load -pin_load 0.05 [get_ports {o_r[59]}]
set_load -pin_load 0.05 [get_ports {o_r[58]}]
set_load -pin_load 0.05 [get_ports {o_r[57]}]
set_load -pin_load 0.05 [get_ports {o_r[56]}]
set_load -pin_load 0.05 [get_ports {o_r[55]}]
set_load -pin_load 0.05 [get_ports {o_r[54]}]
set_load -pin_load 0.05 [get_ports {o_r[53]}]
set_load -pin_load 0.05 [get_ports {o_r[52]}]
set_load -pin_load 0.05 [get_ports {o_r[51]}]
set_load -pin_load 0.05 [get_ports {o_r[50]}]
set_load -pin_load 0.05 [get_ports {o_r[49]}]
set_load -pin_load 0.05 [get_ports {o_r[48]}]
set_load -pin_load 0.05 [get_ports {o_r[47]}]
set_load -pin_load 0.05 [get_ports {o_r[46]}]
set_load -pin_load 0.05 [get_ports {o_r[45]}]
set_load -pin_load 0.05 [get_ports {o_r[44]}]
set_load -pin_load 0.05 [get_ports {o_r[43]}]
set_load -pin_load 0.05 [get_ports {o_r[42]}]
set_load -pin_load 0.05 [get_ports {o_r[41]}]
set_load -pin_load 0.05 [get_ports {o_r[40]}]
set_load -pin_load 0.05 [get_ports {o_r[39]}]
set_load -pin_load 0.05 [get_ports {o_r[38]}]
set_load -pin_load 0.05 [get_ports {o_r[37]}]
set_load -pin_load 0.05 [get_ports {o_r[36]}]
set_load -pin_load 0.05 [get_ports {o_r[35]}]
set_load -pin_load 0.05 [get_ports {o_r[34]}]
set_load -pin_load 0.05 [get_ports {o_r[33]}]
set_load -pin_load 0.05 [get_ports {o_r[32]}]
set_load -pin_load 0.05 [get_ports {o_r[31]}]
set_load -pin_load 0.05 [get_ports {o_r[30]}]
set_load -pin_load 0.05 [get_ports {o_r[29]}]
set_load -pin_load 0.05 [get_ports {o_r[28]}]
set_load -pin_load 0.05 [get_ports {o_r[27]}]
set_load -pin_load 0.05 [get_ports {o_r[26]}]
set_load -pin_load 0.05 [get_ports {o_r[25]}]
set_load -pin_load 0.05 [get_ports {o_r[24]}]
set_load -pin_load 0.05 [get_ports {o_r[23]}]
set_load -pin_load 0.05 [get_ports {o_r[22]}]
set_load -pin_load 0.05 [get_ports {o_r[21]}]
set_load -pin_load 0.05 [get_ports {o_r[20]}]
set_load -pin_load 0.05 [get_ports {o_r[19]}]
set_load -pin_load 0.05 [get_ports {o_r[18]}]
set_load -pin_load 0.05 [get_ports {o_r[17]}]
set_load -pin_load 0.05 [get_ports {o_r[16]}]
set_load -pin_load 0.05 [get_ports {o_r[15]}]
set_load -pin_load 0.05 [get_ports {o_r[14]}]
set_load -pin_load 0.05 [get_ports {o_r[13]}]
set_load -pin_load 0.05 [get_ports {o_r[12]}]
set_load -pin_load 0.05 [get_ports {o_r[11]}]
set_load -pin_load 0.05 [get_ports {o_r[10]}]
set_load -pin_load 0.05 [get_ports {o_r[9]}]
set_load -pin_load 0.05 [get_ports {o_r[8]}]
set_load -pin_load 0.05 [get_ports {o_r[7]}]
set_load -pin_load 0.05 [get_ports {o_r[6]}]
set_load -pin_load 0.05 [get_ports {o_r[5]}]
set_load -pin_load 0.05 [get_ports {o_r[4]}]
set_load -pin_load 0.05 [get_ports {o_r[3]}]
set_load -pin_load 0.05 [get_ports {o_r[2]}]
set_load -pin_load 0.05 [get_ports {o_r[1]}]
set_load -pin_load 0.05 [get_ports {o_r[0]}]
set_ideal_network -no_propagate  [get_ports i_clk]
create_clock [get_ports i_clk]  -period 4.6  -waveform {0 2.3}
set_clock_uncertainty 0.1  [get_clocks i_clk]
set_input_delay -clock i_clk  1  [get_ports i_rst]
set_input_delay -clock i_clk  1  [get_ports i_trig]
set_input_delay -clock i_clk  1  [get_ports {i_data[47]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[46]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[45]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[44]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[43]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[42]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[41]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[40]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[39]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[38]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[37]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[36]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[35]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[34]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[33]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[32]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[31]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[30]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[29]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[28]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[27]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[26]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[25]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[24]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[23]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[22]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[21]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[20]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[19]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[18]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[17]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[16]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[15]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[14]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[13]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[12]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[11]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[10]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[9]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[8]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[7]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[6]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[5]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[4]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[3]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[2]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[1]}]
set_input_delay -clock i_clk  1  [get_ports {i_data[0]}]
set_output_delay -clock i_clk  1  [get_ports o_rd_vld]
set_output_delay -clock i_clk  1  [get_ports o_last_data]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[159]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[158]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[157]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[156]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[155]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[154]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[153]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[152]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[151]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[150]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[149]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[148]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[147]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[146]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[145]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[144]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[143]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[142]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[141]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[140]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[139]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[138]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[137]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[136]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[135]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[134]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[133]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[132]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[131]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[130]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[129]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[128]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[127]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[126]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[125]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[124]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[123]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[122]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[121]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[120]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[119]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[118]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[117]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[116]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[115]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[114]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[113]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[112]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[111]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[110]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[109]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[108]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[107]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[106]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[105]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[104]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[103]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[102]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[101]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[100]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[99]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[98]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[97]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[96]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[95]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[94]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[93]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[92]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[91]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[90]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[89]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[88]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[87]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[86]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[85]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[84]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[83]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[82]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[81]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[80]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[79]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[78]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[77]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[76]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[75]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[74]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[73]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[72]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[71]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[70]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[69]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[68]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[67]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[66]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[65]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[64]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[63]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[62]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[61]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[60]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[59]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[58]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[57]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[56]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[55]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[54]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[53]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[52]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[51]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[50]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[49]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[48]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[47]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[46]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[45]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[44]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[43]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[42]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[41]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[40]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[39]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[38]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[37]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[36]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[35]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[34]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[33]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[32]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[31]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[30]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[29]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[28]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[27]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[26]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[25]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[24]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[23]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[22]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[21]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[20]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[19]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[18]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[17]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[16]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[15]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[14]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[13]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[12]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[11]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[10]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[9]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[8]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[7]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[6]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[5]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[4]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[3]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[2]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[1]}]
set_output_delay -clock i_clk  1  [get_ports {o_y_hat[0]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[319]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[318]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[317]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[316]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[315]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[314]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[313]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[312]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[311]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[310]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[309]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[308]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[307]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[306]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[305]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[304]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[303]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[302]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[301]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[300]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[299]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[298]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[297]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[296]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[295]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[294]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[293]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[292]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[291]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[290]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[289]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[288]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[287]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[286]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[285]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[284]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[283]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[282]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[281]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[280]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[279]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[278]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[277]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[276]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[275]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[274]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[273]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[272]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[271]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[270]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[269]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[268]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[267]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[266]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[265]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[264]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[263]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[262]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[261]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[260]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[259]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[258]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[257]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[256]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[255]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[254]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[253]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[252]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[251]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[250]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[249]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[248]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[247]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[246]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[245]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[244]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[243]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[242]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[241]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[240]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[239]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[238]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[237]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[236]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[235]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[234]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[233]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[232]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[231]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[230]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[229]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[228]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[227]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[226]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[225]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[224]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[223]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[222]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[221]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[220]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[219]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[218]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[217]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[216]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[215]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[214]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[213]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[212]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[211]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[210]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[209]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[208]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[207]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[206]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[205]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[204]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[203]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[202]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[201]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[200]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[199]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[198]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[197]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[196]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[195]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[194]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[193]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[192]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[191]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[190]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[189]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[188]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[187]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[186]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[185]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[184]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[183]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[182]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[181]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[180]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[179]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[178]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[177]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[176]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[175]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[174]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[173]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[172]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[171]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[170]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[169]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[168]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[167]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[166]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[165]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[164]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[163]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[162]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[161]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[160]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[159]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[158]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[157]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[156]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[155]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[154]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[153]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[152]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[151]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[150]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[149]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[148]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[147]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[146]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[145]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[144]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[143]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[142]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[141]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[140]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[139]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[138]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[137]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[136]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[135]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[134]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[133]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[132]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[131]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[130]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[129]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[128]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[127]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[126]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[125]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[124]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[123]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[122]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[121]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[120]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[119]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[118]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[117]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[116]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[115]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[114]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[113]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[112]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[111]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[110]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[109]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[108]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[107]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[106]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[105]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[104]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[103]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[102]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[101]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[100]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[99]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[98]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[97]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[96]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[95]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[94]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[93]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[92]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[91]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[90]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[89]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[88]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[87]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[86]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[85]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[84]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[83]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[82]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[81]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[80]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[79]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[78]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[77]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[76]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[75]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[74]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[73]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[72]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[71]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[70]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[69]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[68]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[67]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[66]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[65]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[64]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[63]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[62]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[61]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[60]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[59]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[58]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[57]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[56]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[55]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[54]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[53]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[52]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[51]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[50]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[49]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[48]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[47]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[46]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[45]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[44]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[43]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[42]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[41]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[40]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[39]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[38]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[37]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[36]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[35]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[34]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[33]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[32]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[31]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[30]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[29]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[28]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[27]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[26]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[25]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[24]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[23]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[22]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[21]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[20]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[19]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[18]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[17]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[16]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[15]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[14]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[13]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[12]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[11]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[10]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[9]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[8]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[7]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[6]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[5]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[4]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[3]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[2]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[1]}]
set_output_delay -clock i_clk  1  [get_ports {o_r[0]}]
set_drive 1  [get_ports i_clk]
set_drive 1  [get_ports i_rst]
set_drive 1  [get_ports i_trig]
set_drive 1  [get_ports {i_data[47]}]
set_drive 1  [get_ports {i_data[46]}]
set_drive 1  [get_ports {i_data[45]}]
set_drive 1  [get_ports {i_data[44]}]
set_drive 1  [get_ports {i_data[43]}]
set_drive 1  [get_ports {i_data[42]}]
set_drive 1  [get_ports {i_data[41]}]
set_drive 1  [get_ports {i_data[40]}]
set_drive 1  [get_ports {i_data[39]}]
set_drive 1  [get_ports {i_data[38]}]
set_drive 1  [get_ports {i_data[37]}]
set_drive 1  [get_ports {i_data[36]}]
set_drive 1  [get_ports {i_data[35]}]
set_drive 1  [get_ports {i_data[34]}]
set_drive 1  [get_ports {i_data[33]}]
set_drive 1  [get_ports {i_data[32]}]
set_drive 1  [get_ports {i_data[31]}]
set_drive 1  [get_ports {i_data[30]}]
set_drive 1  [get_ports {i_data[29]}]
set_drive 1  [get_ports {i_data[28]}]
set_drive 1  [get_ports {i_data[27]}]
set_drive 1  [get_ports {i_data[26]}]
set_drive 1  [get_ports {i_data[25]}]
set_drive 1  [get_ports {i_data[24]}]
set_drive 1  [get_ports {i_data[23]}]
set_drive 1  [get_ports {i_data[22]}]
set_drive 1  [get_ports {i_data[21]}]
set_drive 1  [get_ports {i_data[20]}]
set_drive 1  [get_ports {i_data[19]}]
set_drive 1  [get_ports {i_data[18]}]
set_drive 1  [get_ports {i_data[17]}]
set_drive 1  [get_ports {i_data[16]}]
set_drive 1  [get_ports {i_data[15]}]
set_drive 1  [get_ports {i_data[14]}]
set_drive 1  [get_ports {i_data[13]}]
set_drive 1  [get_ports {i_data[12]}]
set_drive 1  [get_ports {i_data[11]}]
set_drive 1  [get_ports {i_data[10]}]
set_drive 1  [get_ports {i_data[9]}]
set_drive 1  [get_ports {i_data[8]}]
set_drive 1  [get_ports {i_data[7]}]
set_drive 1  [get_ports {i_data[6]}]
set_drive 1  [get_ports {i_data[5]}]
set_drive 1  [get_ports {i_data[4]}]
set_drive 1  [get_ports {i_data[3]}]
set_drive 1  [get_ports {i_data[2]}]
set_drive 1  [get_ports {i_data[1]}]
set_drive 1  [get_ports {i_data[0]}]
